7767517
243 280
Input            input                    0 1 input
Convolution      352                      1 1 input 352 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=432
BatchNorm        353                      1 1 352 353 0=16
ReLU             354                      1 1 353 354
ConvolutionDepthWise 355                      1 1 354 355 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        356                      1 1 355 356 0=16
ReLU             357                      1 1 356 357
Split            splitncnn_0              1 3 357 357_splitncnn_0 357_splitncnn_1 357_splitncnn_2
Pooling          359                      1 1 357_splitncnn_2 359 0=1 1=56 11=56 2=56 12=56 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          367                      1 1 359 367 0=-1
Convolution      368                      1 1 357_splitncnn_1 368 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=256
BatchNorm        369                      1 1 368 369 0=16
ReLU             370                      1 1 369 370
Split            splitncnn_1              1 2 370 370_splitncnn_0 370_splitncnn_1
ConvolutionDepthWise 371                      1 1 370_splitncnn_1 371 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        372                      1 1 371 372 0=16
ReLU             373                      1 1 372 373
Concat           374                      2 1 370_splitncnn_0 373 374 0=0
Crop             375                      1 1 374 375 -23309=1,0 -23310=1,32 -23311=1,0
ConvolutionDepthWise 376                      1 1 375 376 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        377                      1 1 376 377 0=32
Convolution      378                      1 1 377 378 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=320
BatchNorm        379                      1 1 378 379 0=10
Split            splitncnn_2              1 2 379 379_splitncnn_0 379_splitncnn_1
ConvolutionDepthWise 380                      1 1 379_splitncnn_1 380 0=10 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=90 7=10
BatchNorm        381                      1 1 380 381 0=10
Concat           382                      2 1 379_splitncnn_0 381 382 0=0
Crop             383                      1 1 382 383 -23309=1,0 -23310=1,20 -23311=1,0
ConvolutionDepthWise 384                      1 1 357_splitncnn_0 384 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        385                      1 1 384 385 0=16
Convolution      386                      1 1 385 386 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=320
BatchNorm        387                      1 1 386 387 0=20
BinaryOp         388                      2 1 383 387 388 0=0
Split            splitncnn_3              1 2 388 388_splitncnn_0 388_splitncnn_1
Convolution      389                      1 1 388_splitncnn_1 389 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        390                      1 1 389 390 0=20
ReLU             391                      1 1 390 391
Split            splitncnn_4              1 2 391 391_splitncnn_0 391_splitncnn_1
ConvolutionDepthWise 392                      1 1 391_splitncnn_1 392 0=20 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=180 7=20
BatchNorm        393                      1 1 392 393 0=20
ReLU             394                      1 1 393 394
Concat           395                      2 1 391_splitncnn_0 394 395 0=0
Crop             396                      1 1 395 396 -23309=1,0 -23310=1,40 -23311=1,0
Convolution      397                      1 1 396 397 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        398                      1 1 397 398 0=10
Split            splitncnn_5              1 2 398 398_splitncnn_0 398_splitncnn_1
ConvolutionDepthWise 399                      1 1 398_splitncnn_1 399 0=10 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=90 7=10
BatchNorm        400                      1 1 399 400 0=10
Concat           401                      2 1 398_splitncnn_0 400 401 0=0
Crop             402                      1 1 401 402 -23309=1,0 -23310=1,20 -23311=1,0
BinaryOp         403                      2 1 402 388_splitncnn_0 403 0=0
Split            splitncnn_6              1 2 403 403_splitncnn_0 403_splitncnn_1
Convolution      404                      1 1 403_splitncnn_1 404 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        405                      1 1 404 405 0=20
ReLU             406                      1 1 405 406
Split            splitncnn_7              1 2 406 406_splitncnn_0 406_splitncnn_1
ConvolutionDepthWise 407                      1 1 406_splitncnn_1 407 0=20 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=180 7=20
BatchNorm        408                      1 1 407 408 0=20
ReLU             409                      1 1 408 409
Concat           410                      2 1 406_splitncnn_0 409 410 0=0
Crop             411                      1 1 410 411 -23309=1,0 -23310=1,40 -23311=1,0
Convolution      412                      1 1 411 412 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        413                      1 1 412 413 0=10
Split            splitncnn_8              1 2 413 413_splitncnn_0 413_splitncnn_1
ConvolutionDepthWise 414                      1 1 413_splitncnn_1 414 0=10 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=90 7=10
BatchNorm        415                      1 1 414 415 0=10
Concat           416                      2 1 413_splitncnn_0 415 416 0=0
Crop             417                      1 1 416 417 -23309=1,0 -23310=1,20 -23311=1,0
BinaryOp         418                      2 1 417 403_splitncnn_0 418 0=0
Split            splitncnn_9              1 3 418 418_splitncnn_0 418_splitncnn_1 418_splitncnn_2
Pooling          420                      1 1 418_splitncnn_2 420 0=1 1=28 11=28 2=28 12=28 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          428                      1 1 420 428 0=-1
Convolution      429                      1 1 418_splitncnn_1 429 0=30 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=600
BatchNorm        430                      1 1 429 430 0=30
ReLU             431                      1 1 430 431
Split            splitncnn_10             1 2 431 431_splitncnn_0 431_splitncnn_1
ConvolutionDepthWise 432                      1 1 431_splitncnn_1 432 0=30 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=270 7=30
BatchNorm        433                      1 1 432 433 0=30
ReLU             434                      1 1 433 434
Concat           435                      2 1 431_splitncnn_0 434 435 0=0
Crop             436                      1 1 435 436 -23309=1,0 -23310=1,60 -23311=1,0
ConvolutionDepthWise 437                      1 1 436 437 0=60 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=540 7=60
BatchNorm        438                      1 1 437 438 0=60
Convolution      439                      1 1 438 439 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=720
BatchNorm        440                      1 1 439 440 0=12
Split            splitncnn_11             1 2 440 440_splitncnn_0 440_splitncnn_1
ConvolutionDepthWise 441                      1 1 440_splitncnn_1 441 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=108 7=12
BatchNorm        442                      1 1 441 442 0=12
Concat           443                      2 1 440_splitncnn_0 442 443 0=0
Crop             444                      1 1 443 444 -23309=1,0 -23310=1,24 -23311=1,0
ConvolutionDepthWise 445                      1 1 418_splitncnn_0 445 0=20 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=180 7=20
BatchNorm        446                      1 1 445 446 0=20
Convolution      447                      1 1 446 447 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=480
BatchNorm        448                      1 1 447 448 0=24
BinaryOp         449                      2 1 444 448 449 0=0
Split            splitncnn_12             1 2 449 449_splitncnn_0 449_splitncnn_1
Convolution      450                      1 1 449_splitncnn_1 450 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=864
BatchNorm        451                      1 1 450 451 0=36
ReLU             452                      1 1 451 452
Split            splitncnn_13             1 2 452 452_splitncnn_0 452_splitncnn_1
ConvolutionDepthWise 453                      1 1 452_splitncnn_1 453 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=324 7=36
BatchNorm        454                      1 1 453 454 0=36
ReLU             455                      1 1 454 455
Concat           456                      2 1 452_splitncnn_0 455 456 0=0
Crop             457                      1 1 456 457 -23309=1,0 -23310=1,72 -23311=1,0
Convolution      458                      1 1 457 458 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=864
BatchNorm        459                      1 1 458 459 0=12
Split            splitncnn_14             1 2 459 459_splitncnn_0 459_splitncnn_1
ConvolutionDepthWise 460                      1 1 459_splitncnn_1 460 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=108 7=12
BatchNorm        461                      1 1 460 461 0=12
Concat           462                      2 1 459_splitncnn_0 461 462 0=0
Crop             463                      1 1 462 463 -23309=1,0 -23310=1,24 -23311=1,0
BinaryOp         464                      2 1 463 449_splitncnn_0 464 0=0
Split            splitncnn_15             1 2 464 464_splitncnn_0 464_splitncnn_1
Convolution      465                      1 1 464_splitncnn_1 465 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=864
BatchNorm        466                      1 1 465 466 0=36
ReLU             467                      1 1 466 467
Split            splitncnn_16             1 2 467 467_splitncnn_0 467_splitncnn_1
ConvolutionDepthWise 468                      1 1 467_splitncnn_1 468 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=324 7=36
BatchNorm        469                      1 1 468 469 0=36
ReLU             470                      1 1 469 470
Concat           471                      2 1 467_splitncnn_0 470 471 0=0
Crop             472                      1 1 471 472 -23309=1,0 -23310=1,72 -23311=1,0
Convolution      473                      1 1 472 473 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=864
BatchNorm        474                      1 1 473 474 0=12
Split            splitncnn_17             1 2 474 474_splitncnn_0 474_splitncnn_1
ConvolutionDepthWise 475                      1 1 474_splitncnn_1 475 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=108 7=12
BatchNorm        476                      1 1 475 476 0=12
Concat           477                      2 1 474_splitncnn_0 476 477 0=0
Crop             478                      1 1 477 478 -23309=1,0 -23310=1,24 -23311=1,0
BinaryOp         479                      2 1 478 464_splitncnn_0 479 0=0
Split            splitncnn_18             1 3 479 479_splitncnn_0 479_splitncnn_1 479_splitncnn_2
Pooling          481                      1 1 479_splitncnn_2 481 0=1 1=14 11=14 2=14 12=14 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          489                      1 1 481 489 0=-1
Convolution      490                      1 1 479_splitncnn_1 490 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1152
BatchNorm        491                      1 1 490 491 0=48
ReLU             492                      1 1 491 492
Split            splitncnn_19             1 2 492 492_splitncnn_0 492_splitncnn_1
ConvolutionDepthWise 493                      1 1 492_splitncnn_1 493 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=432 7=48
BatchNorm        494                      1 1 493 494 0=48
ReLU             495                      1 1 494 495
Concat           496                      2 1 492_splitncnn_0 495 496 0=0
Crop             497                      1 1 496 497 -23309=1,0 -23310=1,96 -23311=1,0
ConvolutionDepthWise 498                      1 1 497 498 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864 7=96
BatchNorm        499                      1 1 498 499 0=96
Convolution      500                      1 1 499 500 0=18 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1728
BatchNorm        501                      1 1 500 501 0=18
Split            splitncnn_20             1 2 501 501_splitncnn_0 501_splitncnn_1
ConvolutionDepthWise 502                      1 1 501_splitncnn_1 502 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=162 7=18
BatchNorm        503                      1 1 502 503 0=18
Concat           504                      2 1 501_splitncnn_0 503 504 0=0
Crop             505                      1 1 504 505 -23309=1,0 -23310=1,36 -23311=1,0
ConvolutionDepthWise 506                      1 1 479_splitncnn_0 506 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=216 7=24
BatchNorm        507                      1 1 506 507 0=24
Convolution      508                      1 1 507 508 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=864
BatchNorm        509                      1 1 508 509 0=36
BinaryOp         510                      2 1 505 509 510 0=0
Split            splitncnn_21             1 2 510 510_splitncnn_0 510_splitncnn_1
Convolution      511                      1 1 510_splitncnn_1 511 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2592
BatchNorm        512                      1 1 511 512 0=72
ReLU             513                      1 1 512 513
Split            splitncnn_22             1 2 513 513_splitncnn_0 513_splitncnn_1
ConvolutionDepthWise 514                      1 1 513_splitncnn_1 514 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=648 7=72
BatchNorm        515                      1 1 514 515 0=72
ReLU             516                      1 1 515 516
Concat           517                      2 1 513_splitncnn_0 516 517 0=0
Crop             518                      1 1 517 518 -23309=1,0 -23310=1,144 -23311=1,0
Convolution      519                      1 1 518 519 0=18 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2592
BatchNorm        520                      1 1 519 520 0=18
Split            splitncnn_23             1 2 520 520_splitncnn_0 520_splitncnn_1
ConvolutionDepthWise 521                      1 1 520_splitncnn_1 521 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=162 7=18
BatchNorm        522                      1 1 521 522 0=18
Concat           523                      2 1 520_splitncnn_0 522 523 0=0
Crop             524                      1 1 523 524 -23309=1,0 -23310=1,36 -23311=1,0
BinaryOp         525                      2 1 524 510_splitncnn_0 525 0=0
Split            splitncnn_24             1 2 525 525_splitncnn_0 525_splitncnn_1
Convolution      526                      1 1 525_splitncnn_1 526 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2592
BatchNorm        527                      1 1 526 527 0=72
ReLU             528                      1 1 527 528
Split            splitncnn_25             1 2 528 528_splitncnn_0 528_splitncnn_1
ConvolutionDepthWise 529                      1 1 528_splitncnn_1 529 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=648 7=72
BatchNorm        530                      1 1 529 530 0=72
ReLU             531                      1 1 530 531
Concat           532                      2 1 528_splitncnn_0 531 532 0=0
Crop             533                      1 1 532 533 -23309=1,0 -23310=1,144 -23311=1,0
Convolution      534                      1 1 533 534 0=18 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2592
BatchNorm        535                      1 1 534 535 0=18
Split            splitncnn_26             1 2 535 535_splitncnn_0 535_splitncnn_1
ConvolutionDepthWise 536                      1 1 535_splitncnn_1 536 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=162 7=18
BatchNorm        537                      1 1 536 537 0=18
Concat           538                      2 1 535_splitncnn_0 537 538 0=0
Crop             539                      1 1 538 539 -23309=1,0 -23310=1,36 -23311=1,0
BinaryOp         540                      2 1 539 525_splitncnn_0 540 0=0
Split            splitncnn_27             1 2 540 540_splitncnn_0 540_splitncnn_1
Convolution      541                      1 1 540_splitncnn_1 541 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2592
BatchNorm        542                      1 1 541 542 0=72
ReLU             543                      1 1 542 543
Split            splitncnn_28             1 2 543 543_splitncnn_0 543_splitncnn_1
ConvolutionDepthWise 544                      1 1 543_splitncnn_1 544 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=648 7=72
BatchNorm        545                      1 1 544 545 0=72
ReLU             546                      1 1 545 546
Concat           547                      2 1 543_splitncnn_0 546 547 0=0
Crop             548                      1 1 547 548 -23309=1,0 -23310=1,144 -23311=1,0
Convolution      549                      1 1 548 549 0=18 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2592
BatchNorm        550                      1 1 549 550 0=18
Split            splitncnn_29             1 2 550 550_splitncnn_0 550_splitncnn_1
ConvolutionDepthWise 551                      1 1 550_splitncnn_1 551 0=18 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=162 7=18
BatchNorm        552                      1 1 551 552 0=18
Concat           553                      2 1 550_splitncnn_0 552 553 0=0
Crop             554                      1 1 553 554 -23309=1,0 -23310=1,36 -23311=1,0
BinaryOp         555                      2 1 554 540_splitncnn_0 555 0=0
Split            splitncnn_30             1 3 555 555_splitncnn_0 555_splitncnn_1 555_splitncnn_2
Pooling          557                      1 1 555_splitncnn_2 557 0=1 1=7 11=7 2=7 12=7 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          565                      1 1 557 565 0=-1
Convolution      566                      1 1 555_splitncnn_1 566 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1296
BatchNorm        567                      1 1 566 567 0=36
ReLU             568                      1 1 567 568
Split            splitncnn_31             1 2 568 568_splitncnn_0 568_splitncnn_1
ConvolutionDepthWise 569                      1 1 568_splitncnn_1 569 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=324 7=36
BatchNorm        570                      1 1 569 570 0=36
ReLU             571                      1 1 570 571
Concat           572                      2 1 568_splitncnn_0 571 572 0=0
Crop             573                      1 1 572 573 -23309=1,0 -23310=1,72 -23311=1,0
Convolution      574                      1 1 573 574 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=144
BatchNorm        575                      1 1 574 575 0=2
Split            splitncnn_32             1 2 575 575_splitncnn_0 575_splitncnn_1
ConvolutionDepthWise 576                      1 1 575_splitncnn_1 576 0=2 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18 7=2
BatchNorm        577                      1 1 576 577 0=2
Concat           578                      2 1 575_splitncnn_0 577 578 0=0
Crop             579                      1 1 578 579 -23309=1,0 -23310=1,4 -23311=1,0
ConvolutionDepthWise 580                      1 1 555_splitncnn_0 580 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=324 7=36
BatchNorm        581                      1 1 580 581 0=36
Convolution      582                      1 1 581 582 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=144
BatchNorm        583                      1 1 582 583 0=4
BinaryOp         584                      2 1 579 583 584 0=0
Convolution      585                      1 1 584 585 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288
BatchNorm        586                      1 1 585 586 0=8
ReLU             587                      1 1 586 587
Convolution      588                      1 1 587 588 0=32 1=7 11=7 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=12544
ReLU             589                      1 1 588 589
Reshape          597                      1 1 589 597 0=-1
Concat           598                      5 1 367 428 489 565 597 598 0=0
InnerProduct     output                   1 1 598 output 0=196 1=1 2=25088
